{"Character": {"2": {"pk": 2, "npc": true, "canon": false, "name": "Rune", "gender": "non-binary", "image": {"url": "", "asset_id": 0, "raw": null}, "ac": 0, "desc": ["Rune has a androgynous figure, with a slim build and elf-like features. Their hair is a disarray of black, silver streaks slicing through the sea of darkness. Their eyes are the color of fresh spring leaves, holding a gaze that pierces through one's soul."], "backstory": "Rune was found in a mystic rune-circle as a child, no parents or kin in sight. Raised by a retired adventurer in a bustling city, they developed a knack for getting into trouble - and out of it. They seemed, even at a young age, to have an instinctive ability to find secrets and hidden things, and no door or chest stayed locked around them for long. Despite their aggressive nature, they’ve always followed a certain code of logic—often to the frustration of those around them. The truth they eventually discovered about their past was that they were not simply abandoned; they were strategically placed in the rune-circle by their elvish parent because of the prophecy that harbors in their birthmarks - a prophecy foretelling that Rune, with their unique perspective and qualities, may hold the key to preventing an upcoming disaster.", "personality": ["nosy", "aggressive", "logical"], "occupation": "Locksmith", "race": "half-elf", "speed": {}, "class_name": "Rogue", "age": 16, "hp": 0, "wealth": [], "inventory": ["lock picking tools", "a rogue's cloak", "dagger", "hunting trap", "mysterious elven artifact"], "str": 8, "dex": 16, "con": 12, "wis": 10, "int": 13, "cha": 15, "features": {}, "spells": {}, "resistances": [], "chats": [], "conversation_summary": "The player character (PC) greets Rune, a non-player character (NPC) with spring leaf-colored eyes. Rune, noticing that the PC is a newcomer, inquires about their purpose for visiting, implying that the PC's appearance suggests they didn't just find the place by chance.", "backstory_summary": "Rune, a D&D character, was discovered as a child in a mystic rune-circle with no family around. They were brought up by a retired adventurer in a busy city, where they frequently found themselves in and out of trouble. From a young age, Rune had a natural talent for uncovering secrets and unlocking doors or chests. Despite their combative nature, they adhered to a unique logic, often puzzling those around them. Rune later learned that they were intentionally left in the rune-circle by their elvish parent due to a prophecy linked to their birthmarks. This prophecy suggested that Rune's distinctive abilities and viewpoint could be crucial in averting a looming catastrophe.", "last_updated": {"_datetime": "2023-08-22T17:03:53.596673"}}}}