{"Shop": {"12": {"pk": 12, "name": "The Serrated Quill", "image": {"url": "", "asset_id": 0, "raw": null}, "shoptype": "Blacksmith", "owner": {"_pk": 4, "_automodel": "dmtoolkit.models.dndcharacter.Character"}, "inventory": [{"name": "Longsword +1", "desc": "A well-balanced, sharp longsword that offers an attack bonus.", "cost": "300 gp"}, {"name": "Mithril Chainmail", "desc": "A suit of chainmail made from light, shining mithril, offering superior protection without hindering movement.", "cost": "750 gp"}, {"name": "Gauntlet of Ogre Power", "desc": "This sturdy leather glove augments the wearer's physical power, allowing them to strike with the strength of an ogre.", "cost": "800 gp"}], "location": "", "desc": "This blacksmith shop is filled with the rhythmic clang of hammered metal. Anvils, tongs, and half-finished weapons are meticulously organized. Strips of polished steel shimmer in the light."}, "13": {"pk": 13, "name": "The Golden Gryphon", "image": {"asset_id": "02505064a44cf504037993e1c4ae110e", "url": "http://res.cloudinary.com/dzzdfujbf/image/upload/v1689261590/dnd/shops/sus0dmafezf1iyflxnbm.png", "raw": null}, "shoptype": "Magic Shop", "owner": {"_pk": 6, "_automodel": "dmtoolkit.models.dndcharacter.Character"}, "inventory": [{"name": "Scroll of Fireball", "desc": "This scroll contains a single use spell of Fireball. When used, it creates a burst of flame that deals 8d6 fire damage. Any creature in the area can make a Dexterity saving throw for half damage.", "cost": "150 gold pieces"}, {"name": "Potion of Healing", "desc": "This small vial contains a magically enchanted liquid. When consumed, it heals the drinker for 2d4 + 2 hit points.", "cost": "50 gold pieces"}, {"name": "Wand of the War Mage, +1", "desc": "This slender wand is tipped with a single, glowing gem. When in the hands of a spell-caster, it gives +1 bonus to spell attack rolls. It can be used to ignore half cover when casting spells.", "cost": "600 gold pieces"}, {"name": "Bag of Holding", "desc": "This unassuming bag is larger on the inside than it appears on the outside. It can hold up to 500 pounds or 64 cubic feet but always weighs only 15 pounds.", "cost": "4000 gold pieces"}], "location": "", "desc": "You step into a room glowing with an ethereal, soft light. Every wall is lined with bookshelves stuffed with scrolls and tomes. In the center, a large cauldron gently bubbles, with a sizzle of sparks flying off every now and then. The air smells of parchment, ink, and a strange underlying scent of ozone."}}}